include 'emu8086.inc'       ; EMU8086 এর লাইব্রেরি ব্যবহার করার জন্য
org 100h                   ; প্রোগ্রাম শুরু হওয়ার মেমোরি ঠিকানা নির্ধারণ

jmp start                  ; সরাসরি start লেবেলে চলে যাবে

start:
print "Enter the number: " ; সংখ্যা ইনপুট চাওয়া হচ্ছে
call scan_num              ; ইউজার থেকে সংখ্যা পড়বে, রেজিস্টার cx-তে থাকবে
mov bx,0                   ; bx রেজিস্টার শূন্য করে (যোগফল রাখার জন্য)

printn                    ; নতুন লাইনে যাবে
print "Input the numbers: " ; পরবর্তী সংখ্যাগুলো ইনপুট চাওয়া হচ্ছে
mov si,cx                  ; cx-র মান si-তে কপি করা হচ্ছে (ইনপুট সংখ্যা কত বার নেওয়া হবে)

l:
call scan_num              ; আরেকটি সংখ্যা ইনপুট নেয়া হবে
add bx,cx                 ; bx-তে ওই সংখ্যাটি যোগ করা হচ্ছে
printn                    ; নতুন লাইনে যাবে
dec si                    ; si থেকে 1 কমানো (লুপ কাউন্টার)
jnz l                     ; যদি si != 0 হয়, আবার লুপে যাবে

print "Total = "          ; যোগফলের টেক্সট প্রিন্ট করবে
mov ax,bx                 ; bx থেকে ax-তে যোগফল কপি করবে
call print_num            ; ax-র মান প্রিন্ট করবে

printn                    ; নতুন লাইনে যাবে

mov ah,4ch                ; প্রোগ্রাম শেষ করার জন্য DOS ইন্টারাপ্ট প্রস্তুত করবে
int 21h                   ; প্রোগ্রাম বন্ধ হবে

define_scan_num           ; স্ক্যান নম্বর ফাংশন ডিফাইন
define_print_num_uns      ; অসমsigned নম্বর প্রিন্ট ফাংশন ডিফাইন
define_print_num          ; নম্বর প্রিন্ট ফাংশন ডিফাইন

end start                 ; প্রোগ্রামের শেষ এবং শুরু ঠিকানা
